app/views/books/_comment.html.erb

<td>
コメント数：<%= book.post_comments.count %>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]