app/views/books/_post.html.erb

  <span class="glyphicon glyphicon-heart" aria-hidden="true"></span>
  <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

  <span class="glyphicon glyphicon-heart-empty" aria-hidden="true"></span>
  <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 8]]