app/views/books/_post_comment.html.erb

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
---
<% @book.post_comments.each do |post_comment| %>