app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index
    @user = User.find(current_user.id)
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # ユーザーデータを取得
    @user = User.find(params[:id])

UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "aaa"], ["profile_image_id", nil], ["updated_at", "2020-08-19 12:57:37.704960"], ["id", 1]]
---
  def create
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def follower
    user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def followed
    user = User.find(params[:user_id])